<?
    include_once('./kurly_header.php');
    
    $userId = "gksmf519";
    $번호 = "SUB_001_001";
    $이미지 = "./images/sub/sub1/092881a3-ff30-4914-9039-e7cbaf59c31e.jpg";
    $제품명 = "[광화문 미진] 전라도김장양념5.5kg (예약일 수령)";
    $할인율 = 0.1;
    $판매가 = 0;
    $제품특징 = "깊은 감칠맛의 전라도식 김치 양념";
    $제조사 = "";
    $제조일시 = "1999-09-03 23:30:00";
    $판매처 = "";
    $보관방법 = "상온";
    $배송 = "샛별배송";
    $옵션 = "단일상품";
    $옵션상품목록 = "";
    $정가 = 41000;
    $일시 = "1999-09-03 23:30:00";
    $제품코드 = "SUB_001_001";
    $장바구니상품명 = "";
    $수량 = 1;
    
    
    // 장바구니 저장    
    

    $sql = "INSERT INTO green_kurly_cart_table (userId,번호,이미지,제품명,할인율,판매가,제품특징,제조사,제조일시,판매처,보관방법,배송,옵션,옵션상품목록,정가,일시,제품코드,장바구니상품명,수량)
            VALUES ('$userId','$번호','$이미지','$제품명','$할인율','$판매가','$제품특징','$제조사','$제조일시','$판매처','$보관방법','$배송','$옵션','$옵션상품목록','$정가','$일시','$제품코드','$장바구니상품명','$수량')";
    $result = mysqli_query($conn, $sql);
    
    if($result==true){
        echo "장바구니 테이블 저장 성공!";
    }
    else{
        echo "장바구니 테이블 저장 실패!";
    }

?>